/*
모의고사

문제 설명
수포자는 수학을 포기한 사람의 준말입니다. 수포자 삼인방은 모의고사에 수학 문제를 전부 찍으려 합니다. 수포자는 1번 문제부터 마지막 문제까지 다음과 같이 찍습니다.

1번 수포자가 찍는 방식: 1, 2, 3, 4, 5, 1, 2, 3, 4, 5, ...
2번 수포자가 찍는 방식: 2, 1, 2, 3, 2, 4, 2, 5, 2, 1, 2, 3, 2, 4, 2, 5, ...
3번 수포자가 찍는 방식: 3, 3, 1, 1, 2, 2, 4, 4, 5, 5, 3, 3, 1, 1, 2, 2, 4, 4, 5, 5, ...

1번 문제부터 마지막 문제까지의 정답이 순서대로 들은 배열 answers가 주어졌을 때, 가장 많은 문제를 맞힌 사람이 누구인지 배열에 담아 return 하도록 solution 함수를 작성해주세요.

제한 조건
시험은 최대 10,000 문제로 구성되어있습니다.
문제의 정답은 1, 2, 3, 4, 5중 하나입니다.
가장 높은 점수를 받은 사람이 여럿일 경우, return하는 값을 오름차순 정렬해주세요.
입출력 예
answers	return
[1,2,3,4,5]	[1]
[1,3,2,4,2]	[1,2,3]
*/

function solution(answers) {
    const arr1 = [
        [1,2,3,4,5],
        [2,1,2,3,2,4,2,5],
        [3,3,1,1,2,2,4,4,5,5]
    ];
    const result = [
        [1,0],
        [2,0],
        [3,0]
    ];

    for(let i =0; i < answers.length; i++){
        if(answers[i] == arr1[0][i % arr1[0].length]) result[0][1] += 1;
        if(answers[i] == arr1[1][i % arr1[1].length]) result[1][1] += 1;
        if(answers[i] == arr1[2][i % arr1[2].length]) result[2][1] += 1;
    }
    
    result.sort((a, b) => b[1] - a[1]);

    const max = [result[0][0]];
    for(let i=1; i < result.length; i++){
        if(result[0][1] == result[i][1]) max.push(result[i][0]);
    }
    
    return max.sort((a,b) => a - b);
}

//출처 : 프로그래머스 완전탐색 모의고사, https://programmers.co.kr/learn/courses/30/lessons/42840?language=javascript
------------------------------------------------------------------------------------------------------------------
해당 문제는 완전 탐색으로 전체 검색해서 그냥 값을 출력하면 되는 문제입니다.
