/*
124 나라의 숫자
문제 설명
124 나라가 있습니다. 124 나라에서는 10진법이 아닌 다음과 같은 자신들만의 규칙으로 수를 표현합니다.

124 나라에는 자연수만 존재합니다.
124 나라에는 모든 수를 표현할 때 1, 2, 4만 사용합니다.
예를 들어서 124 나라에서 사용하는 숫자는 다음과 같이 변환됩니다.

10진법	124 나라	10진법	124 나라
1	1	6	14
2	2	7	21
3	4	8	22
4	11	9	24
5	12	10	41
자연수 n이 매개변수로 주어질 때, n을 124 나라에서 사용하는 숫자로 바꾼 값을 return 하도록 solution 함수를 완성해 주세요.

제한사항
n은 500,000,000이하의 자연수 입니다.
입출력 예
n	result
1	1
2	2
3	4
4	11
*/

function solution(n) {
      const numbers = [4, 1, 2];
      let answer = '';
      
      while(n > 0){
          answer = numbers[n%3] + answer;
          
          if(n % 3 === 0) n = (n/3)-1; //예 n = 12 -> 12/3 - 1 -> n = 3; 
          else n = Math.floor(n/3);
      }
    return answer;
}

// 출처: 프로그래머스 연습문제, 124나라의 숫자, https://programmers.co.kr/learn/courses/30/lessons/12899
----------------------------------------------------------------------------------------------------
해당 문제는 n을 3진법으로 변환하듯, 124로 진법 변환을 문제입니다.

124 3가지로 변환을 해야하기 때문에,  n % 3 === 0 으로 나눠지면, 이미 위에서 해당 4를 넣었기 때문에 124에 대해 나눠야하기 때문에 / 3을 하고 -1처리로 
다음 값으로 넘겨줍니다.
